<?php

return [
    'title.required' => 'عنوان الزامی است.',
    'title.string' => 'عنوان باید یک رشته باشد.',
    'title.max' => 'عنوان نمی‌تواند بیشتر از 255 کاراکتر باشد.',

    'related_customer.required' => 'وارد کردن مشتری الزامی است.',
    'related_customer.string' => 'مشتری مرتبط باید یک رشته باشد.',
    'related_customer.max' => 'مشتری مرتبط نمی‌تواند بیشتر از 255 کاراکتر باشد.',

    'cost.required' => 'وارد کردن هزینه الزامی است.',
    'cost.numeric' => 'هزینه باید یک عدد باشد.',
    'cost.regex' => 'هزینه باید یک عدد صحیح یا اعشاری با حداکثر دو رقم اعشاری باشد.',
];
